Revit.Elements.Wall.ByFace(System.String,Revit.Elements.WallType,Autodesk.DesignScript.Geometry.Surface)
Creates a Wall following the geometry of a surface.
Walls by Faces cannot be updated, any geometry change will
create a new wall and delete the old one.
locationLine:
wallType:
surface:
Returns: